Tools/logger.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>日志框架</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">日志框架</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4bab9a9">1. 背景</a></li>
<li><a href="#orgb6d4845">2. java.util.logging</a></li>
<li><a href="#org4ad6ceb">3. Apache Common-Logging 接口</a></li>
<li><a href="#org0b9644f">4. SLF4j 接口</a></li>
<li><a href="#org9c1a0a6">5. Log4j</a></li>
<li><a href="#org4b11981">6. SLF4j + Logback</a></li>
</ul>
</div>
</nav>




<section id="outline-container-org4bab9a9" class="outline-2">
<h2 id="org4bab9a9"><span class="section-number-2">1</span> 背景</h2>
<div class="outline-text-2" id="text-1">
<p>
为了记录程序的运行信息，传统的方式，是使用 <code>System.out.println</code>。
</p>

<p>
但是这种方式，虽然简单，却有很多缺点:
</p>
<ol class="org-ol">
<li>无法对日志的输出，做有效的控制</li>
<li>效率不够高</li>
<li>功能不够强，比如无法对日志进行自动格式化输出</li>
<li>输出的目的地比较单一，只能输出在控制台</li>
</ol>


<p>
比如，要对日志的输出与否做控制，可以做简单的封装:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">LogUtil</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">boolean</span> <span class="org-variable-name">logSwitch</span> = <span class="org-constant">true</span>;

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">log</span>(<span class="org-type">String</span> <span class="org-variable-name">msg</span>) {
        <span class="org-keyword">if</span> (logSwitch) {
            System.out.println(msg);
        }
    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Logutil.log("ksdjksdjfjk");</span>
</pre>
</div>

<p>
对于更复杂的情况，需要进一步封装。
</p>

<p>
对于一个通用的日志空间，至少需要以下概念:
</p>
<ul class="org-ul">
<li><code>logger</code>，日志对象，使用它产生日志记录</li>
<li><code>level</code>，日志级别，用来控制日志的显示与否</li>
<li><code>formatter/render/layout</code>，日志格式，用来控制日志输出的格式、样式</li>
<li><code>handler/appender</code>，处理器，用来将日志输出到相应目的地（屏幕？文件？数据库？）</li>
</ul>
</div>
</section>

<section id="outline-container-orgb6d4845" class="outline-2">
<h2 id="orgb6d4845"><span class="section-number-2">2</span> java.util.logging</h2>
<div class="outline-text-2" id="text-2">
<p>
Java 自带的日志框架。
</p>

<p>
基本使用:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Logger</span> <span class="org-variable-name">logger</span> = LogManager.getLogger(A.<span class="org-keyword">class</span>);

<span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">test</span>() {
    logger.info(<span class="org-string">"A.info"</span>);
    logger.warning(<span class="org-string">"A.warning"</span>);
    logger.severe(<span class="org-string">"A.servere"</span>);
    logger.fine(<span class="org-string">"A.fine"</span>);
}
</pre>
</div>
</div>
</section>

<section id="outline-container-org4ad6ceb" class="outline-2">
<h2 id="org4ad6ceb"><span class="section-number-2">3</span> Apache Common-Logging 接口</h2>
</section>
<section id="outline-container-org0b9644f" class="outline-2">
<h2 id="org0b9644f"><span class="section-number-2">4</span> SLF4j 接口</h2>
</section>
<section id="outline-container-org9c1a0a6" class="outline-2">
<h2 id="org9c1a0a6"><span class="section-number-2">5</span> Log4j</h2>
</section>
<section id="outline-container-org4b11981" class="outline-2">
<h2 id="org4b11981"><span class="section-number-2">6</span> SLF4j + Logback</h2>
<div class="outline-text-2" id="text-6">
<p>
在 pom.xml 中添加:
</p>
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">dependency</span>&gt;
  &lt;<span class="org-function-name">groupId</span>&gt;ch.qos.logback&lt;/<span class="org-function-name">groupId</span>&gt;
  &lt;<span class="org-function-name">artifactId</span>&gt;logback-classic&lt;/<span class="org-function-name">artifactId</span>&gt;
  &lt;<span class="org-function-name">version</span>&gt;1.2.3&lt;/<span class="org-function-name">version</span>&gt;
&lt;/<span class="org-function-name">dependency</span>&gt;
</pre>
</div>

<p>
在 classpath 下面添加 logback.xml:
</p>
<div class="org-src-container">
<pre class="src src-sgml"><span class="org-string">&lt;?xml version="1.0" encoding="UTF-8"?&gt;</span>
&lt;<span class="org-function-name">configuration</span>&gt;
  &lt;<span class="org-function-name">appender</span> <span class="org-variable-name">name</span>=<span class="org-string">"STDOUT"</span> <span class="org-variable-name">class</span>=<span class="org-string">"ch.qos.logback.core.ConsoleAppender"</span>&gt;
    &lt;<span class="org-function-name">layout</span> <span class="org-variable-name">class</span>=<span class="org-string">"ch.qos.logback.classic.PatternLayout"</span>&gt;
      &lt;<span class="org-function-name">Pattern</span>&gt;
        <span class="org-variable-name">%msg%n</span>
      &lt;/<span class="org-function-name">Pattern</span>&gt;
    &lt;/<span class="org-function-name">layout</span>&gt;

    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">mybatis &#30340;&#35774;&#32622; </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;<span class="org-function-name">logger</span> <span class="org-variable-name">name</span>=<span class="org-string">"com.nf147.sss.dao"</span> <span class="org-variable-name">level</span>=<span class="org-string">"debug"</span> <span class="org-variable-name">additivity</span>=<span class="org-string">"false"</span>&gt;
      &lt;<span class="org-function-name">appender-ref</span> <span class="org-variable-name">ref</span>=<span class="org-string">"STDOUT"</span> /&gt;
    &lt;/<span class="org-function-name">logger</span>&gt;

    &lt;<span class="org-function-name">root</span> <span class="org-variable-name">level</span>=<span class="org-string">"error"</span>&gt;
      &lt;<span class="org-function-name">appender-ref</span> <span class="org-variable-name">ref</span>=<span class="org-string">"STDOUT"</span> /&gt;
    &lt;/<span class="org-function-name">root</span>&gt;
&lt;/<span class="org-function-name">configuration</span>&gt;
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:23</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
